starter-kit-defuns.org
#+TITLE: Starter Kit Defuns
#+OPTIONS: toc:nil num:nil ^:nil

This is part of the [[file:starter-kit.org][Emacs Starter Kit]].

* Starter Kit Defuns
** The starter-kit-coding-hook
A single hook holding those functions which should be run in *every*
code buffer.

We have a number of turn-on-* functions since it's advised that lambda
functions not go in hooks. Repeatedly evaling an add-to-list with a
hook value will repeatedly add it since there's no way to ensure that
a lambda doesn't already exist in the list.

#+BEGIN_SRC emacs-lisp
  (defun sk-smartparens ()
    (turn-on-smartparens-mode))

  (defun sk-local-comment-auto-fill ()
    (set (make-local-variable 'comment-auto-fill-only-comments) t)
    (auto-fill-mode t))

  (defun sk-pretty-lambdas ()
    (font-lock-add-keywords
     nil `(("(?\\(lambda\\>\\)"
            (0 (progn (compose-region (match-beginning 1) (match-end 1)
                                      ,(make-char 'greek-iso8859-7 107))
                      nil))))))

  (defun sk-add-watchwords ()
    (font-lock-add-keywords
     nil '(("\\<\\(FIX\\(ME\\)?\\|TODO\\|HACK\\|REFACTOR\\|NOCOMMIT\\)"
            1 font-lock-warning-face t))))

  (defun sk-indent-or-complete ()
    "Complete if point is at end of a word, otherwise indent line."
    (interactive)
    (if (looking-at "\\>")
        (hippie-expand nil)
      (indent-for-tab-command)))

  (defun sk-hide-show-mode ()
    (local-set-key (kbd "<s-right>") 'hs-show-block)
    (local-set-key (kbd "<s-left>")  'hs-hide-block)
    (local-set-key (kbd "<s-up>")    'hs-hide-all)
    (local-set-key (kbd "<s-down>")  'hs-show-all)
    (hs-minor-mode   t)
    (diminish 'hs-minor-mode)
    )
#+END_SRC

Perform a bunch of safe operations on the whitespace content of a
buffer. Does not indent buffer, because it is used for a
=before-save-hook=, and that might be bad.
#+BEGIN_SRC emacs-lisp
  (defun sk-cleanup-buffer-safe ()
    (interactive)
    ;;(untabify (point-min) (point-max))
    (delete-trailing-whitespace))
#+END_SRC

Perform a bunch of operations on the whitespace content of a
buffer. Including indent-buffer, which should not be called
automatically on save.
#+BEGIN_SRC emacs-lisp
  (defun sk-cleanup-buffer ()
    (interactive)
    (starter-kit-cleanup-buffer-safe)
    (indent-region (point-min) (point-max)))
#+END_SRC

** Handling buffers
*** Rename/Move both current buffer and file currently visited
From [[http://steve.yegge.googlepages.com/my-dot-emacs-file][Steve Yegge .emacs]]
#+BEGIN_SRC emacs-lisp
  (defun sk-rename-file-and-buffer (new-name)
    "Renames both current buffer and file it's visiting to NEW-NAME."
    (interactive "sNew name: ")
    (let ((name (buffer-name))
          (filename (buffer-file-name)))
      (if (not filename)
          (message "Buffer '%s' is not visiting a file!" name)
        (if (get-buffer new-name)
            (message "A buffer named '%s' already exists!" new-name)
          (progn
            (rename-file name new-name 1)
            (rename-buffer new-name)
            (set-visited-file-name new-name)
            (set-buffer-modified-p nil))))))

  (defun sk-move-buffer-file (dir)
    "Moves both current buffer and file it's visiting to DIR."
    (interactive "DNew directory: ")
    (let* ((name (buffer-name))
           (filename (buffer-file-name))
           (dir
            (if (string-match dir "\\(?:/\\|\\\\)$")
                (substring dir 0 -1) dir))
           (newname (concat dir "/" name)))

      (if (not filename)
          (message "Buffer '%s' is not visiting a file!" name)
        (progn (copy-file filename newname 1)
               (delete-file filename)
               (set-visited-file-name newname)
               (set-buffer-modified-p nil) t))))
#+END_SRC

*** Delete current buffer file
From [[http://whattheemacsd.com/file-defuns.el-02.html][Magnars blog]]
#+BEGIN_SRC emacs-lisp
  (defun sk-delete-current-buffer-file ()
    "Removes file connected to current buffer and kills buffer."
    (interactive)
    (let ((filename (buffer-file-name))
          (buffer (current-buffer))
          (name (buffer-name)))
      (if (not (and filename (file-exists-p filename)))
          (ido-kill-buffer)
        (when (yes-or-no-p "Are you sure you want to remove this file? ")
          (delete-file filename)
          (kill-buffer buffer)
          (message "File '%s' successfully removed" filename)))))
#+END_SRC

*** Stop displaying minibuffer when mouse go to another buffer
#+BEGIN_SRC emacs-lisp
  (defun sk-stop-using-minibuffer ()
    "Kill the minibuffer"
    (when (and (>= (recursion-depth) 1) (active-minibuffer-window))
      (abort-recursive-edit)))
#+END_SRC

