starter-kit-defuns.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Starter Kit Defuns</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="css/styles.css" />
               <link rel="stylesheet" href="css/org-pygments.css" />
               <link rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" />
</head>
<body onload="randomLinkColor();displayTOC();"><div id="toc"></div>
<div id="preamble" class="status">
 <a href="https://github.com/xgarrido/emacs-starter-kit"><i class="fa fa-github"></i></a><br/> 
</div>
<div id="content">
<h1 class="title">Starter Kit Defuns</h1>
<p>
This is part of the <a href="starter-kit.html">Emacs Starter Kit</a>.
</p>

<div id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">Starter Kit Defuns</h2>
<div class="outline-text-2" id="text-unnumbered-1">
</div><div id="outline-container-unnumbered-2" class="outline-3">
<h3 id="unnumbered-2">The starter-kit-coding-hook</h3>
<div class="outline-text-3" id="text-unnumbered-2">
<p>
A single hook holding those functions which should be run in <b>every</b>
code buffer.
</p>

<p>
We have a number of turn-on-* functions since it's advised that lambda
functions not go in hooks. Repeatedly evaling an add-to-list with a
hook value will repeatedly add it since there's no way to ensure that
a lambda doesn't already exist in the list.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">sk-smartparens</span> ()
  (turn-on-smartparens-mode))

(<span class="org-keyword">defun</span> <span class="org-function-name">sk-local-comment-auto-fill</span> ()
  (set (make-local-variable 'comment-auto-fill-only-comments) t)
  (auto-fill-mode t))

(<span class="org-keyword">defun</span> <span class="org-function-name">sk-pretty-lambdas</span> ()
  (font-lock-add-keywords
   nil `((<span class="org-string">"(?</span><span class="org-regexp-grouping-backslash"><span class="org-string">\\</span></span><span class="org-regexp-grouping-construct"><span class="org-string">(</span></span><span class="org-string">lambda\\&gt;</span><span class="org-regexp-grouping-backslash"><span class="org-string">\\</span></span><span class="org-regexp-grouping-construct"><span class="org-string">)</span></span><span class="org-string">"</span>
          (0 (<span class="org-keyword">progn</span> (compose-region (match-beginning 1) (match-end 1)
                                    ,(make-char 'greek-iso8859-7 107))
                    nil))))))

(<span class="org-keyword">defun</span> <span class="org-function-name">sk-add-watchwords</span> ()
  (font-lock-add-keywords
   nil '((<span class="org-string">"\\&lt;</span><span class="org-regexp-grouping-backslash"><span class="org-string">\\</span></span><span class="org-regexp-grouping-construct"><span class="org-string">(</span></span><span class="org-string">FIX</span><span class="org-regexp-grouping-backslash"><span class="org-string">\\</span></span><span class="org-regexp-grouping-construct"><span class="org-string">(</span></span><span class="org-string">ME</span><span class="org-regexp-grouping-backslash"><span class="org-string">\\</span></span><span class="org-regexp-grouping-construct"><span class="org-string">)</span></span><span class="org-string">?</span><span class="org-regexp-grouping-backslash"><span class="org-string">\\</span></span><span class="org-regexp-grouping-construct"><span class="org-string">|</span></span><span class="org-string">TODO</span><span class="org-regexp-grouping-backslash"><span class="org-string">\\</span></span><span class="org-regexp-grouping-construct"><span class="org-string">|</span></span><span class="org-string">HACK</span><span class="org-regexp-grouping-backslash"><span class="org-string">\\</span></span><span class="org-regexp-grouping-construct"><span class="org-string">|</span></span><span class="org-string">REFACTOR</span><span class="org-regexp-grouping-backslash"><span class="org-string">\\</span></span><span class="org-regexp-grouping-construct"><span class="org-string">|</span></span><span class="org-string">NOCOMMIT</span><span class="org-regexp-grouping-backslash"><span class="org-string">\\</span></span><span class="org-regexp-grouping-construct"><span class="org-string">)</span></span><span class="org-string">"</span>
          1 font-lock-warning-face t))))

(<span class="org-keyword">defun</span> <span class="org-function-name">sk-indent-or-complete</span> ()
  <span class="org-doc">"Complete if point is at end of a word, otherwise indent line."</span>
  (interactive)
  (<span class="org-keyword">if</span> (looking-at <span class="org-string">"\\&gt;"</span>)
      (hippie-expand nil)
    (indent-for-tab-command)))

(<span class="org-keyword">defun</span> <span class="org-function-name">sk-hide-show-mode</span> ()
  (local-set-key (kbd <span class="org-string">"&lt;s-right&gt;"</span>) 'hs-show-block)
  (local-set-key (kbd <span class="org-string">"&lt;s-left&gt;"</span>)  'hs-hide-block)
  (local-set-key (kbd <span class="org-string">"&lt;s-up&gt;"</span>)    'hs-hide-all)
  (local-set-key (kbd <span class="org-string">"&lt;s-down&gt;"</span>)  'hs-show-all)
  (hs-minor-mode   t)
  )
</pre>
</div>

<p>
Perform a bunch of safe operations on the whitespace content of a
buffer. Does not indent buffer, because it is used for a
<code>before-save-hook</code>, and that might be bad.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">sk-cleanup-buffer-safe</span> ()
  (interactive)
  <span class="org-comment-delimiter">;;</span><span class="org-comment">(untabify (point-min) (point-max))</span>
  (delete-trailing-whitespace))
</pre>
</div>

<p>
Perform a bunch of operations on the whitespace content of a
buffer. Including indent-buffer, which should not be called
automatically on save.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">sk-cleanup-buffer</span> ()
  (interactive)
  (starter-kit-cleanup-buffer-safe)
  (indent-region (point-min) (point-max)))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-3" class="outline-3">
<h3 id="unnumbered-3">Handling buffers</h3>
<div class="outline-text-3" id="text-unnumbered-3">
</div><div id="outline-container-unnumbered-4" class="outline-4">
<h4 id="unnumbered-4">Rename/Move both current buffer and file currently visited</h4>
<div class="outline-text-4" id="text-unnumbered-4">
<p>
From <a href="http://steve.yegge.googlepages.com/my-dot-emacs-file">Steve Yegge .emacs</a>
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">sk-rename-file-and-buffer</span> (new-name)
  <span class="org-doc">"Renames both current buffer and file it's visiting to NEW-NAME."</span>
  (interactive <span class="org-string">"sNew name: "</span>)
  (<span class="org-keyword">let</span> ((name (buffer-name))
        (filename (buffer-file-name)))
    (<span class="org-keyword">if</span> (not filename)
        (message <span class="org-string">"Buffer '%s' is not visiting a file!"</span> name)
      (<span class="org-keyword">if</span> (get-buffer new-name)
          (message <span class="org-string">"A buffer named '%s' already exists!"</span> new-name)
        (<span class="org-keyword">progn</span>
          (rename-file name new-name 1)
          (rename-buffer new-name)
          (set-visited-file-name new-name)
          (set-buffer-modified-p nil))))))

(<span class="org-keyword">defun</span> <span class="org-function-name">sk-move-buffer-file</span> (dir)
  <span class="org-doc">"Moves both current buffer and file it's visiting to DIR."</span>
  (interactive <span class="org-string">"DNew directory: "</span>)
  (<span class="org-keyword">let*</span> ((name (buffer-name))
         (filename (buffer-file-name))
         (dir
          (<span class="org-keyword">if</span> (string-match dir <span class="org-string">"</span><span class="org-regexp-grouping-backslash"><span class="org-string">\\</span></span><span class="org-regexp-grouping-construct"><span class="org-string">(?:</span></span><span class="org-string">/</span><span class="org-regexp-grouping-backslash"><span class="org-string">\\</span></span><span class="org-regexp-grouping-construct"><span class="org-string">|</span></span><span class="org-string">\\\\)$"</span>)
              (substring dir 0 -1) dir))
         (newname (concat dir <span class="org-string">"/"</span> name)))

    (<span class="org-keyword">if</span> (not filename)
        (message <span class="org-string">"Buffer '%s' is not visiting a file!"</span> name)
      (<span class="org-keyword">progn</span> (copy-file filename newname 1)
             (delete-file filename)
             (set-visited-file-name newname)
             (set-buffer-modified-p nil) t))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-5" class="outline-4">
<h4 id="unnumbered-5">Delete current buffer file</h4>
<div class="outline-text-4" id="text-unnumbered-5">
<p>
From <a href="http://whattheemacsd.com/file-defuns.el-02.html">Magnars blog</a>
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">sk-delete-current-buffer-file</span> ()
  <span class="org-doc">"Removes file connected to current buffer and kills buffer."</span>
  (interactive)
  (<span class="org-keyword">let</span> ((filename (buffer-file-name))
        (buffer (current-buffer))
        (name (buffer-name)))
    (<span class="org-keyword">if</span> (not (and filename (file-exists-p filename)))
        (ido-kill-buffer)
      (<span class="org-keyword">when</span> (yes-or-no-p <span class="org-string">"Are you sure you want to remove this file? "</span>)
        (delete-file filename)
        (kill-buffer buffer)
        (message <span class="org-string">"File '%s' successfully removed"</span> filename)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-6" class="outline-4">
<h4 id="unnumbered-6">Stop displaying minibuffer when mouse go to another buffer</h4>
<div class="outline-text-4" id="text-unnumbered-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">sk-stop-using-minibuffer</span> ()
  <span class="org-doc">"Kill the minibuffer"</span>
  (<span class="org-keyword">when</span> (and (&gt;= (recursion-depth) 1) (active-minibuffer-window))
    (abort-recursive-edit)))
</pre>
</div>
</div>
</div>
