starter-kit-defuns.org
*** Touching the current buffer
#+BEGIN_SRC emacs-lisp
  (defun sk-touch ()
    (interactive)
    (shell-command (concat "touch " (shell-quote-argument (buffer-file-name)))))
#+END_SRC

*** Splitting buffer
When splitting is done, emacs will open the next buffer
#+BEGIN_SRC emacs-lisp
  (defadvice split-window-vertically
    (after my-window-splitting-advice first () activate)
    (set-window-buffer (next-window) (other-buffer)))
  (defadvice split-window-horizontally
    (after my-window-splitting-advice first () activate)
    (set-window-buffer (next-window) (other-buffer)))
#+END_SRC

** Handling window
From [[http://whattheemacsd.com//buffer-defuns.el-03.html][Magnars blog]]
#+BEGIN_SRC emacs-lisp
  (defun sk-toggle-window-split ()
    (interactive)
    (if (= (count-windows) 2)
        (let* ((this-win-buffer (window-buffer))
               (next-win-buffer (window-buffer (next-window)))
               (this-win-edges (window-edges (selected-window)))
               (next-win-edges (window-edges (next-window)))
               (this-win-2nd (not (and (<= (car this-win-edges)
                                           (car next-win-edges))
                                       (<= (cadr this-win-edges)
                                           (cadr next-win-edges)))))
               (splitter
                (if (= (car this-win-edges)
                       (car (window-edges (next-window))))
                    'split-window-horizontally
                  'split-window-vertically)))
          (delete-other-windows)
          (let ((first-win (selected-window)))
            (funcall splitter)
            (if this-win-2nd (other-window 1))
            (set-window-buffer (selected-window) this-win-buffer)
            (set-window-buffer (next-window) next-win-buffer)
            (select-window first-win)
            (if this-win-2nd (other-window 1))))))
#+END_SRC

** Saving desktop status
#+BEGIN_SRC emacs-lisp
  (defun sk-desktop ()
    "Load the desktop and enable autosaving"
    (interactive)
    (let ((desktop-load-locked-desktop "ask"))
      (desktop-read)
      (desktop-save-mode 1)))

  (defun sk-desktop-save ()
    (interactive)
    (desktop-save desktop-dirname))
#+END_SRC

** Misc.
*** Edit current buffer with sudo rights
#+BEGIN_SRC emacs-lisp
  (defun sk-sudo-edit-current-file (&optional arg)
    (interactive "p")
    (if (or arg (not buffer-file-name))
        (find-file (concat "/sudo:root@localhost:" (ido-read-file-name "File: ")))
      (find-alternate-file (concat "/sudo:root@localhost:" buffer-file-name))))
#+END_SRC

*** Grepping words
For sure there might be a better way and tool to do that but I am used
to use it
#+BEGIN_SRC emacs-lisp
  (defun sk-grep ()
    "grep the whole directory for something defaults to term at cursor position"
    (interactive)
    (setq default (thing-at-point 'symbol))
    (setq needle (or (read-string (concat "grep for <" default "> ")) default))
    (setq needle (if (equal needle "") default needle))
    (grep (concat "egrep -s -i -n -r " needle " *")))
#+END_SRC

Try to use also [[https://github.com/jhelwig/ack-and-a-half][ack-and-a-half]] and create shorter aliases
#+BEGIN_SRC emacs-lisp
  (defalias 'ack 'ack-and-a-half)
  (defalias 'ack-same 'ack-and-a-half-same)
  (defalias 'ack-find-file 'ack-and-a-half-find-file)
  (defalias 'ack-find-file-same 'ack-and-a-half-find-file-same)
  (setq ack-and-a-half-use-ido t)
#+END_SRC

*** Toggling fullscreen
#+BEGIN_SRC emacs-lisp
  (defun sk-toggle-fullscreen ()
    (interactive)
    (set-frame-parameter nil 'fullscreen (if (frame-parameter nil 'fullscreen)
                                             nil
                                             'fullboth)))
#+END_SRC

*** Sending libnotify popup
#+BEGIN_SRC emacs-lisp
  (defun sk-popup (title msg)
    "Show a popup if we're on X, or echo it otherwise; TITLE is the
  title of the message, MSG is the context."
    (if (eq window-system 'x)
        (shell-command (concat "notify-send -t 2000 -i emacs"
                               " '" title "' '" msg "'"))
      ;; text only version
      (message (concat title ": " msg))))
  (defun sk-test-popup ()
    (interactive)
    (sk-popup "Test Notification :" "test"))
#+END_SRC

*** Googling active region
From [[http://emacsredux.com/blog/2013/03/28/google/][Emacs redux]].
#+BEGIN_SRC emacs-lisp
  (defun sk-google ()
    "Google the selected region if any, display a query prompt otherwise."
    (interactive)
    (browse-url
     (concat
      "http://www.google.com/search?ie=utf-8&oe=utf-8&q="
      (url-hexify-string (if mark-active
                             (buffer-substring (region-beginning) (region-end))
                           (read-string "Google: "))))))
  (global-set-key (kbd "s-g") 'sk-google)
#+END_SRC

*** Printing unicode
From [[http://tromey.com/blog/?p=831]].
#+BEGIN_SRC emacs-lisp
  (defun sk-list-unicode-display (&optional regexp)
    "Display a list of unicode characters and their names in a buffer."
    (interactive "sRegexp (default \".*\"): ")
    (let* ((regexp (or regexp ".*"))
           (case-fold-search t)
           (cmp (lambda (x y) (< (cdr x) (cdr y))))
           ;; alist like ("name" . code-point)
           (char-alist (sort (cl-remove-if-not (lambda (x) (string-match regexp (car x)))
                                               (ucs-names))
                             cmp)))
      (with-help-window "*Unicode characters*"
        (with-current-buffer standard-output
          (dolist (c char-alist)
            (insert (format "0x%06X\t" (cdr c)))
            (insert (cdr c))
            (insert (format "\t%s\n" (car c))))))))
#+END_SRC


** Hooks
