starter-kit-defuns.html

<div id="outline-container-unnumbered-7" class="outline-4">
<h4 id="unnumbered-7">Touching the current buffer</h4>
<div class="outline-text-4" id="text-unnumbered-7">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">sk-touch</span> ()
  (interactive)
  (shell-command (concat <span class="org-string">"touch "</span> (shell-quote-argument (buffer-file-name)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-8" class="outline-4">
<h4 id="unnumbered-8">Splitting buffer</h4>
<div class="outline-text-4" id="text-unnumbered-8">
<p>
When splitting is done, emacs will open the next buffer
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">defadvice</span> <span class="org-function-name">split-window-vertically</span>
  (after my-window-splitting-advice first () activate)
  (set-window-buffer (next-window) (other-buffer)))
(<span class="org-keyword">defadvice</span> <span class="org-function-name">split-window-horizontally</span>
  (after my-window-splitting-advice first () activate)
  (set-window-buffer (next-window) (other-buffer)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-unnumbered-9" class="outline-3">
<h3 id="unnumbered-9">Handling window</h3>
<div class="outline-text-3" id="text-unnumbered-9">
<p>
From <a href="http://whattheemacsd.com//buffer-defuns.el-03.html">Magnars blog</a>
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">sk-toggle-window-split</span> ()
  (interactive)
  (<span class="org-keyword">if</span> (= (count-windows) 2)
      (<span class="org-keyword">let*</span> ((this-win-buffer (window-buffer))
             (next-win-buffer (window-buffer (next-window)))
             (this-win-edges (window-edges (selected-window)))
             (next-win-edges (window-edges (next-window)))
             (this-win-2nd (not (and (&lt;= (car this-win-edges)
                                         (car next-win-edges))
                                     (&lt;= (cadr this-win-edges)
                                         (cadr next-win-edges)))))
             (splitter
              (<span class="org-keyword">if</span> (= (car this-win-edges)
                     (car (window-edges (next-window))))
                  'split-window-horizontally
                'split-window-vertically)))
        (delete-other-windows)
        (<span class="org-keyword">let</span> ((first-win (selected-window)))
          (funcall splitter)
          (<span class="org-keyword">if</span> this-win-2nd (other-window 1))
          (set-window-buffer (selected-window) this-win-buffer)
          (set-window-buffer (next-window) next-win-buffer)
          (select-window first-win)
          (<span class="org-keyword">if</span> this-win-2nd (other-window 1))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-10" class="outline-3">
<h3 id="unnumbered-10">Saving desktop status</h3>
<div class="outline-text-3" id="text-unnumbered-10">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">sk-desktop</span> ()
  <span class="org-doc">"Load the desktop and enable autosaving"</span>
  (interactive)
  (<span class="org-keyword">let</span> ((desktop-load-locked-desktop <span class="org-string">"ask"</span>))
    (desktop-read)
    (desktop-save-mode 1)))

(<span class="org-keyword">defun</span> <span class="org-function-name">sk-desktop-save</span> ()
  (interactive)
  (desktop-save desktop-dirname))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-11" class="outline-3">
<h3 id="unnumbered-11">Misc.</h3>
<div class="outline-text-3" id="text-unnumbered-11">
</div><div id="outline-container-unnumbered-12" class="outline-4">
<h4 id="unnumbered-12">Edit current buffer with sudo rights</h4>
<div class="outline-text-4" id="text-unnumbered-12">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">sk-sudo-edit-current-file</span> (<span class="org-type">&amp;optional</span> arg)
  (interactive <span class="org-string">"p"</span>)
  (<span class="org-keyword">if</span> (or arg (not buffer-file-name))
      (find-file (concat <span class="org-string">"/sudo:root@localhost:"</span> (ido-read-file-name <span class="org-string">"File: "</span>)))
    (find-alternate-file (concat <span class="org-string">"/sudo:root@localhost:"</span> buffer-file-name))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-13" class="outline-4">
<h4 id="unnumbered-13">Grepping words</h4>
<div class="outline-text-4" id="text-unnumbered-13">
<p>
For sure there might be a better way and tool to do that but I am used
to use it
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">sk-grep</span> ()
  <span class="org-doc">"grep the whole directory for something defaults to term at cursor position"</span>
  (interactive)
  (setq default (thing-at-point 'symbol))
  (setq needle (or (read-string (concat <span class="org-string">"grep for &lt;"</span> default <span class="org-string">"&gt; "</span>)) default))
  (setq needle (<span class="org-keyword">if</span> (equal needle <span class="org-string">""</span>) default needle))
  (grep (concat <span class="org-string">"egrep -s -i -n -r "</span> needle <span class="org-string">" *"</span>)))
</pre>
</div>

<p>
Try to use also <a href="https://github.com/jhelwig/ack-and-a-half">ack-and-a-half</a> and create shorter aliases
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">defalias</span> '<span class="org-function-name">ack</span> 'ack-and-a-half)
(<span class="org-keyword">defalias</span> '<span class="org-function-name">ack-same</span> 'ack-and-a-half-same)
(<span class="org-keyword">defalias</span> '<span class="org-function-name">ack-find-file</span> 'ack-and-a-half-find-file)
(<span class="org-keyword">defalias</span> '<span class="org-function-name">ack-find-file-same</span> 'ack-and-a-half-find-file-same)
(setq ack-and-a-half-use-ido t)
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-14" class="outline-4">
<h4 id="unnumbered-14">Toggling fullscreen</h4>
<div class="outline-text-4" id="text-unnumbered-14">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">sk-toggle-fullscreen</span> ()
  (interactive)
  (set-frame-parameter nil 'fullscreen (<span class="org-keyword">if</span> (frame-parameter nil 'fullscreen)
                                           nil
                                           'fullboth)))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-15" class="outline-4">
<h4 id="unnumbered-15">Sending libnotify popup</h4>
<div class="outline-text-4" id="text-unnumbered-15">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">sk-popup</span> (title msg)
  <span class="org-doc">"Show a popup if we're on X, or echo it otherwise; TITLE is the</span>
<span class="org-doc">title of the message, MSG is the context."</span>
  (<span class="org-keyword">if</span> (eq window-system 'x)
      (shell-command (concat <span class="org-string">"notify-send -t 2000 -i emacs"</span>
                             <span class="org-string">" '"</span> title <span class="org-string">"' '"</span> msg <span class="org-string">"'"</span>))
    <span class="org-comment-delimiter">;; </span><span class="org-comment">text only version</span>
    (message (concat title <span class="org-string">": "</span> msg))))
(<span class="org-keyword">defun</span> <span class="org-function-name">sk-test-popup</span> ()
  (interactive)
  (sk-popup <span class="org-string">"Test Notification :"</span> <span class="org-string">"test"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-16" class="outline-4">
<h4 id="unnumbered-16">Googling active region</h4>
<div class="outline-text-4" id="text-unnumbered-16">
<p>
From <a href="http://emacsredux.com/blog/2013/03/28/google/">Emacs redux</a>.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">sk-google</span> ()
  <span class="org-doc">"Google the selected region if any, display a query prompt otherwise."</span>
  (interactive)
  (browse-url
   (concat
    <span class="org-string">"http://www.google.com/search?ie=utf-8&amp;oe=utf-8&amp;q="</span>
    (url-hexify-string (<span class="org-keyword">if</span> mark-active
                           (buffer-substring (region-beginning) (region-end))
                         (read-string <span class="org-string">"Google: "</span>))))))
(global-set-key (kbd <span class="org-string">"s-g"</span>) 'sk-google)
</pre>
</div>
</div>
</div>
</div>
