starter-kit-defuns.org
*** Coding
#+BEGIN_SRC emacs-lisp
  (add-hook 'starter-kit-coding-hook 'sk-local-comment-auto-fill)
  (add-hook 'starter-kit-coding-hook 'sk-pretty-lambdas)
  (add-hook 'starter-kit-coding-hook 'sk-smartparens)
  (add-hook 'starter-kit-coding-hook 'sk-add-watchwords)
  (add-hook 'starter-kit-coding-hook 'sk-hide-show-mode)
  (add-hook 'starter-kit-coding-hook 'idle-highlight-mode)
  (add-hook 'starter-kit-coding-hook 'wrap-region-mode)
  (add-hook 'starter-kit-coding-hook 'linum-mode)
  (add-hook 'starter-kit-coding-hook 'turn-on-fci-mode)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (defun run-starter-kit-coding-hook ()
    "Enable things that are convenient across all coding buffers."
    (run-hooks 'starter-kit-coding-hook))
#+END_SRC

*** Indent correctly pasted code
#+BEGIN_SRC emacs-lisp :tangle no
  (defadvice yank (after indent-region activate)
  (if (member major-mode '(emacs-lisp-mode scheme-mode lisp-mode
                                           c-mode c++-mode objc-mode
                                           latex-mode plain-tex-mode
                                           python-mode org-mode))
      (indent-region (region-beginning) (region-end) nil)))
#+END_SRC

*** Clean up buffer before saving
#+BEGIN_SRC emacs-lisp
  (add-hook 'before-save-hook 'sk-cleanup-buffer-safe)
#+END_SRC

*** Store session before saving
#+BEGIN_SRC emacs-lisp
  (add-hook 'auto-save-hook 'sk-desktop-save)
#+END_SRC

*** Create a directory when there is not
#+BEGIN_SRC emacs-lisp
  (add-hook 'before-save-hook
            (lambda ()
              (let ((dir (file-name-directory buffer-file-name)))
                (when (and (not (file-exists-p dir))
                           (y-or-n-p (format "Directory %s does not exist. Create it?" dir)))
                  (make-directory dir t)))))
#+END_SRC
*** Misc.
#+BEGIN_SRC emacs-lisp
  (add-hook 'mouse-leave-buffer-hook 'sk-stop-using-minibuffer)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (add-hook 'text-mode-hook 'turn-on-auto-fill)
#+END_SRC
