starter-kit-defuns.html

<div id="outline-container-unnumbered-17" class="outline-3">
<h3 id="unnumbered-17">Hooks</h3>
<div class="outline-text-3" id="text-unnumbered-17">
</div><div id="outline-container-unnumbered-18" class="outline-4">
<h4 id="unnumbered-18">Coding</h4>
<div class="outline-text-4" id="text-unnumbered-18">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'starter-kit-coding-hook 'sk-local-comment-auto-fill)
(add-hook 'starter-kit-coding-hook 'sk-pretty-lambdas)
(add-hook 'starter-kit-coding-hook 'sk-smartparens)
(add-hook 'starter-kit-coding-hook 'sk-add-watchwords)
(add-hook 'starter-kit-coding-hook 'sk-hide-show-mode)
(add-hook 'starter-kit-coding-hook 'idle-highlight-mode)
(add-hook 'starter-kit-coding-hook 'wrap-region-mode)
(add-hook 'starter-kit-coding-hook 'linum-mode)
(add-hook 'starter-kit-coding-hook 'turn-on-fci-mode)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">run-starter-kit-coding-hook</span> ()
  <span class="org-doc">"Enable things that are convenient across all coding buffers."</span>
  (run-hooks 'starter-kit-coding-hook))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-19" class="outline-4">
<h4 id="unnumbered-19">Indent correctly pasted code</h4>
<div class="outline-text-4" id="text-unnumbered-19">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">defadvice</span> <span class="org-function-name">yank</span> (after indent-region activate)
(<span class="org-keyword">if</span> (member major-mode '(emacs-lisp-mode scheme-mode lisp-mode
                                         c-mode c++-mode objc-mode
                                         latex-mode plain-tex-mode
                                         python-mode org-mode))
    (indent-region (region-beginning) (region-end) nil)))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-20" class="outline-4">
<h4 id="unnumbered-20">Clean up buffer before saving</h4>
<div class="outline-text-4" id="text-unnumbered-20">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'before-save-hook 'sk-cleanup-buffer-safe)
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-21" class="outline-4">
<h4 id="unnumbered-21">Store session before saving</h4>
<div class="outline-text-4" id="text-unnumbered-21">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'auto-save-hook 'sk-desktop-save)
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-22" class="outline-4">
<h4 id="unnumbered-22">Create a directory when there is not</h4>
<div class="outline-text-4" id="text-unnumbered-22">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'before-save-hook
          (<span class="org-keyword">lambda</span> ()
            (<span class="org-keyword">let</span> ((dir (file-name-directory buffer-file-name)))
              (<span class="org-keyword">when</span> (and (not (file-exists-p dir))
                         (y-or-n-p (format <span class="org-string">"Directory %s does not exist. Create it?"</span> dir)))
                (make-directory dir t)))))
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-23" class="outline-4">
<h4 id="unnumbered-23">Misc.</h4>
<div class="outline-text-4" id="text-unnumbered-23">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'mouse-leave-buffer-hook 'sk-stop-using-minibuffer)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'text-mode-hook 'turn-on-auto-fill)
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
File under <i class="fa fa-github-alt"></i> version control - commit <a href="https://github.com/xgarrido/emacs-starter-kit/commit/ca36d898eb26a0a28edd198439d599bbab05bb1c">ca36d89</a> - 2014-11-05
</div>
</body>
</html>
